{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"filters": 32, "batch_input_shape": [null, 254, 316, 3], "bias_constraint": null, "kernel_size": [5, 5], "name": "conv2d_1", "padding": "same", "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 16, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_2", "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 8, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_3", "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "seed": null, "name": "dropout_1", "noise_shape": null, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 512, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_2", "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 3, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_5", "trainable": true}}], "keras_version": "2.0.9", "backend": "tensorflow"}